class AccordionConstants:
    ACCORDION_HEADING_COUNT = 8
    ACCORDION_HEADING_LOCATOR = "accordion__heading"
    ACCORDION_PANELS_LOCATOR = "accordion__panel"
    ACCORDION_PANELS_TEXTS = [
        'Сутки — 400 рублей. Оплата курьеру — наличными или картой.',
        'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.',
        'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.',
        'Только начиная с завтрашнего дня. Но скоро станем расторопнее.',
        'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.',
        'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.',
        'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.',
        'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
    ]


class UserInfoConstants:
    data_1 = {
        'first_name': 'Петр',
        'second_name': 'Петров',
        'address': 'Москва',
        'phone_number': '+79161234567',
        'order_comment': 'Тестовый комментарий 1'
    }
    data_2 = {
        'first_name': 'Иван',
        'second_name': 'Иванов',
        'address': 'Волгоград',
        'phone_number': '+79161112233',
        'order_comment': 'Тестовый комментарий 2'
    }